Autodesk.Revit.DB.SolidGeometryOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SolidGeometryOptions.SolidTag
Optional solid tag for the Solid.
Since:
2019

Autodesk.Revit.DB.SolidGeometryOptions.#ctor(System.Int32)
Creates a new SolidOptions class with solid tag settings.
solidTag:
The material id for the Solid.
Since:
2019

Autodesk.Revit.DB.SolidGeometryOptions
A class containing optional information to control the geometry generation of the Solid by the SolidUtils routines.
Since:
2019